{
    "class_name": "ResNet1D18",
    "config": {
        "name": "resnet1d18_1",
        "layers": [
            {
                "name": "input_1",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        30,
                        2
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_1"
                },
                "inbound_nodes": []
            },
            {
                "name": "padding_conv1",
                "class_name": "ZeroPadding1D",
                "config": {
                    "name": "padding_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        3,
                        3
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv1",
                "class_name": "Conv1D",
                "config": {
                    "name": "conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        7
                    ],
                    "strides": [
                        2
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "padding_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn_conv1",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "bn_conv1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv1_relu",
                "class_name": "Activation",
                "config": {
                    "name": "conv1_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "pool1",
                "class_name": "MaxPooling1D",
                "config": {
                    "name": "pool1",
                    "trainable": true,
                    "dtype": "float32",
                    "strides": [
                        2
                    ],
                    "pool_size": [
                        3
                    ],
                    "padding": "same",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "padding2a_branch2a",
                "class_name": "ZeroPadding1D",
                "config": {
                    "name": "padding2a_branch2a",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "pool1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_branch2a",
                "class_name": "Conv1D",
                "config": {
                    "name": "res2a_branch2a",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3
                    ],
                    "strides": [
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "padding2a_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2a_branch2a",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "bn2a_branch2a",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_branch2a_relu",
                "class_name": "Activation",
                "config": {
                    "name": "res2a_branch2a_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "padding2a_branch2b",
                "class_name": "ZeroPadding1D",
                "config": {
                    "name": "padding2a_branch2b",
                    "trainable": true,
                    "dtype": "float32",
                    "padding": [
                        1,
                        1
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2a_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_branch2b",
                "class_name": "Conv1D",
                "config": {
                    "name": "res2a_branch2b",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3
                    ],
                    "strides": [
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "padding2a_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_branch1",
                "class_name": "Conv1D",
                "config": {
                    "name": "res2a_branch1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        1
                    ],
                    "strides": [
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "pool1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2a_branch2b",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "bn2a_branch2b",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch2b",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bn2a_branch1",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "bn2a_branch1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 1e-05,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a_branch1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a",
                "class_name": "Add",
                "config": {
                    "name": "res2a",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "bn2a_branch2b",
                            0,
                            0,
                            {}
                        ],
                        [
                            "bn2a_branch1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "res2a_relu",
                "class_name": "Activation",
                "config": {
                    "name": "res2a_relu",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "pool5",
                "class_name": "GlobalAveragePooling1D",
                "config": {
                    "name": "pool5",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "res2a_relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "fc1000",
                "class_name": "Dense",
                "config": {
                    "name": "fc1000",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "pool5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "fc1000",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.3.0",
    "backend": "tensorflow"
}
